spec/dummy/app/controllers/images_controller.rb

INSERT INTO "images" ("created_at", "image_uid", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 02 Feb 2012 15:59:48 UTC +00:00], ["image_uid", "2012/02/02/21_59_48_81_DSC09418.jpg"], ["updated_at", Thu, 02 Feb 2012 15:59:48 UTC +00:00]]
---
  def create
    @image = @page.images.build(params[:image])

    if @image.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_page
    @page = Page.find(params[:page_id])